// recipes.js
const recipes = [
{
    id: "solet",
    title: "דייסת סולת",
    author: "סבתא ברטה",
    tags: [
        "חלבי",
        "קינוחים"
    ],
    image: "https://static.wixstatic.com/media/55beb2_e5030096adc6442696c67239ad4832aa~mv2.jpg/v1/fill/w_2077,h_1558,al_c,q_90/55beb2_e5030096adc6442696c67239ad4832aa~mv2.webp",
    sourceUrl: "",
    ingredients: [
        {
            sectionName: "בסיס",
            items: [
                {
                    amount: 1,
                    unit: "כוסות",
                    item: "מים"
                },
                {
                    amount: 2,
                    unit: "כוסות",
                    item: "חלב"
                }
            ]
        },
        {
            sectionName: "סולת",
            items: [
                {
                    amount: 9,
                    unit: "כפיות מלאות",
                    item: "סולת"
                },
                {
                    amount: 0.5,
                    unit: "כוסות",
                    item: "חלב"
                }
            ]
        }
    ],
    instructions: "מביאים לרתיחה חלב עם מים (2/3 חלב 1/3 מים).\n\nבחצי כוס חלב ממיסים ומערבבים סולת (על כל כוס נוזלים 3 כפיות מלאות סולת). מערבבים היטב עד קבלת תערובת הומוגנית ללא גושים.\n\nעם רתיחת החלב מוסיפים את הסולת ומערבבים היטב למניעת גושים. מביאים לרתיחה ומנמיכים לאש קטנה עד להסמכת הדיסה\n\nאפשר להוסיף טעמים: אבקת שוקו, קינמון, וניל וכו'.\n"
},
{
    id: "tiramisu",
    title: "טירמיסו",
    author: "אופק",
    tags: [
        "חלבי",
        "עוגות"
    ],
    image: "https://www.cookingclassy.com/wp-content/uploads/2022/08/tiramisu-17.jpg",
    sourceUrl: "",
    ingredients: [
        {
            sectionName: "קרם",
            items: [
                {
                    amount: 500,
                    unit: "גרם",
                    item: "מסקרפונה (עדיף 40%+ שומן)"
                },
                {
                    amount: 150,
                    unit: "גרם",
                    item: "אבקת סוכר"
                },
                {
                    amount: 5,
                    unit: "כפות",
                    item: "ברנדי\\מרסלה\\רום\\ויסקי"
                },
                {
                    amount: 1,
                    unit: "מיכל",
                    item: "שמנת מתוקה"
                },
                {
                    amount: 5,
                    unit: "יח'",
                    item: "חלמונים"
                }
            ]
        },
        {
            sectionName: "ספוג",
            items: [
                {
                    amount: 400,
                    unit: "גרם",
                    item: "בישקוטים (עדיף איטלקטי)"
                },
                {
                    amount: 90,
                    unit: "מ\"ל",
                    item: "קפה חזק (3 מנות\\קפסולות)"
                },
                {
                    amount: 7,
                    unit: "כפות",
                    item: "ברנדי (או פחות, לפי הטעם)"
                },
                {
                    amount: 7,
                    unit: "כפות",
                    item: "קלואה (או פחות, לפי הטעם)"
                }
            ]
        },
        {
            sectionName: "למי שרוצה להכין בישקוטי - מומלץ, אבל לא חובה",
            items: [
                {
                    amount: 3,
                    unit: "יח'",
                    item: "ביצה (טמפ' החדר)"
                },
                {
                    amount: 75,
                    unit: "גרם",
                    item: "סוכר"
                },
                {
                    amount: 95,
                    unit: "גרם",
                    item: "קמח (מנופה)"
                },
                {
                    amount: 2,
                    unit: "כפיות",
                    item: "קורנפלור"
                },
                {
                    amount: 50,
                    unit: "גרם",
                    item: "אבקת סוכר"
                }
            ]
        }
    ],
    instructions: "המתכון לפי תבנית סטנדרטית של 35X23\n\n<u>קרם:\n</u>1.\tשמים את החלמונים, הסוכר והליקר על בן מארי וטורפים ללא הפסקה, עד שהנוזל מסמיך ומקבל מרקם דומה \n        לפודינג. זה לוקח כ 5-10 דקות.\n2.\tמקציפים את השמנת לקצפת קלה ןכמעט יציבה (אם מוציאים כף נשארת גבעה עם שפיץ). \n3.\tמוסיפים את המסקרפונה לקצפת ומקציפים עוד קצת עד שמתקבלת קצפת אחידה ויציבה. להיזהר לא להקציף יותר מדי, אנחנו לא רוצים להגיע למרקם של פבלובה.\n4.\tמקפלים את תערובת החלמונים לקרם. הוא יראה מעט זהוב ונוזלי, אבל מאוחר יותר הוא משנה את צבעו ללבן \n        ומתייצב בקירור. \n\n<u>הרכבה:\n</u>-\tמערבבים את תערובת הקפה בקערה רחבה, טובלים כל עוגיה קלות בנוזל ושמים בתבנית עד שכל התחתית מכוסה. יש \n        להיזהר לא לטבול יותר מדי, העוגיה לא צריכה להיות נוזלית, אחרת תתפרק וישארו משקעי נוזל בתחתית התבנית.\n-\tמורחים שכבת קרם אחידה מעל העוגיות\n-\tשכבת עוגיות נוספת\n-\tשכבת קרם נוספת-\n-\tלהשאיר לילה במקרר להתייצבות. \n-\tלפני ההגשה, מפזרים מעל אבקת קקאו באמצעות מסננת.\n\n<u>מתכון לבישקוטי: </u>\nהחומרים ל-24 בישקוטי גדולים או 45 קטנים (6-7.5 ס\"מ):\n\nכלים:\n2 תבניות אפייה, מרופדות בנייר אפייה משומן\n\nלינק: https://www.cookie-fairy.com/2011/11/daring-bakers_1012/\n\nאופן ההכנה:\nלחמם תנור לחום בינוני 180 מעלות. להפריד את הביצים, ולהקציף את החלבונים בקערת מערבל חשמלי לקצף יציב. להוסיף פנימה בהדרגה את הסוכר ולהמשיך להקציף עד לקבלת קצף מבריק וחלק. בקערה קטנה לטרוף חלמונים במזלג ולקפל אותם בעדינות אל המרנג בעזרת כף עץ. לנפות את הקמח והקורנפלור מעל התערובת, ולקפל אותם פנימה בעדינות רק עד לקבלת תערובת חלקה, יש לקפל את התערובת כמה שפחות, ממש רק עד שמתאחדת, כדי לשמור על האווריריות הגדולה של הבלילה.\n"
},
{
    id: "pastel",
    title: "פשטל דה נאטה",
    author: "אופק",
    tags: [
        "חלבי",
        "קינוחים"
    ],
    image: "images/pastel.jpg",
    sourceUrl: "",
    ingredients: [
        {
			sectionName: "לתחתית",
			items: [
				{
					amount: 300,
        unit: "גרם",
        item: "בצק עלים מופשר, עדיף על בסיס חמאה"
				}
			]
        },
        {
            sectionName: "לסירופ",
            items: [
                {
                    amount: 0.3333333333333333,
                    unit: "כוס",
                    item: "מים"
                },
                {
                    amount: 1,
                    unit: "כוס",
                    item: "סוכר"
                },
                {
                    amount: 2,
                    unit: "יח'",
                    item: "מקל קינמון"
                },
                {
                    amount: 2,
                    unit: "יח'",
                    item: "קליפת לימון מקולפת (לא מגוררת)"
                }
            ]
        },
        {
            sectionName: "למלית",
            items: [
                {
                    amount: 1,
                    unit: "כוס",
                    item: "חלב"
                },
                {
                    amount: 3,
                    unit: "כפות",
                    item: "קמח"
                },
                {
                    amount: 6,
                    unit: "יח'",
                    item: "חלמונים (L)"
                },
                {
                    amount: 1,
                    unit: "כפית",
                    item: "תמצית וניל"
                },
                {
                    amount: 0.25,
                    unit: "כוס",
                    item: "שמנת מתוקה"
                }
            ]
        },
        {
            sectionName: "ניתן להוסיף גם:",
            items: [
                {
                    amount: 1,
                    unit: "כף",
                    item: "ברנדי"
                },
                {
                    amount: 0.5,
                    unit: "כפית",
                    item: "קינמון טחון (צריך מסוג סיילון, אחרת גרוס גס מדי)"
                }
            ]
        }
    ],
    instructions: "1.\tבסיר קטן על אש בינונית שמים מים, סוכר, מקלות קינמון וקליפת לימון. מביאים לרתיחה, ואז מורידים לאש הכי \n        נמוכה ומכסים. להשאיר 20-30 דקות ולכבות את האש.\n        (לא חובה, אבל אם יש זמן וסבלנות, ניתן גם להשאיר 1-3 שעות בלי להבה - ייתן את התוצאה הכי טובה).\n\n2.\tמשמנים את תבנית המתכת עם חמאה\n\n3.\tחותכים את הבצק ל 12 חתיכות שוות, מרדדים עם מערוך לעיגולים, ומרפדים את השקעים. מניחים בצד. \n\nהערה: אין מה להקפיד שפינות העיגולים יהיו ישרות, גם ככה בצק העלים תופח איך שבא לו.\n\n4.\tמחממים תנור ל220 מעלות, על מצב טורבו.\n\n5.\tעל אש קטנה-בינונית, מביאים לרתיחה עדינה שמנת מתוקה, חצי מכמות החלב ותמצית וניל\n        (פה נכנסים גם הברנדי והקינמון הטחון, אם הוספתם). לערבב מדי פעם כדי שלא ייווצר קרום.\n\n6.\tבינתיים, בקערת מיקסר, שמים את הקמח ונותנים לו כמה סיבובים במהירות בינונית (במקום לנפות). מוסיפים חצי       \n        כוס חלב ומערבבים במהירות נמוכה עד שתתקבל תערובת חלקה ללא גושים. מוסיפים את החלמונים וממשיכים לערבב \n        במהירות בינונית עד שהחלמונים נטמעים בבלילה.\n\n7.\tמצרפים את סירופ הסוכר דרך מסננת לשמנת החמה ומערבבים. ניתן לזרוק את הקליפות והקינמון.\n\n8.\tתוך כדי ערבוב מתמיד ומהיר של בלילת החלמונים, שופכים אליה בהדרגה 1/2 מכמות השמנת החמה עם הסירופ עד \n        שמתקבלת תערובת אחידה. מעבירים הכל לסיר על אש נמוכה-בינונית ומערבבים עם מטרפה עד שהתערובת מסמיכה \n        (מרקם דומה למלבי לפני קירור). בדרך כלל לוקח כ 4-10 דקות.\n\n9.\tמוזגים עם מצקת את הבלילה לשקעי הבצק, ומכניסים לתנור ל 15-20 דקות. עד שהבצק נראה אפוי ומתחילים \n        להיווצר עיגולים שחורים בקרום הבלילה.\n\nניתן לאכול בטמפ' החדר ביום ההכנה, או או לשים במקרר עד שבוע ולאכול קר. בעיניי המאפה הכי טעים אחרי יום-יומיים במקרר כי טעמי התבלינים בבלילה מעמיקים.\n\n<u>הערה:</u> אפשר להחליף רבע כוס חלב ברבע כוס נוספת של שמנת אם אוהבים. הפשטל יצא יותר קרמי, חלק ועשיר, אבל פחות קליל. \n"
},
];