// recipes.js
const recipes = [
{
    id: "solet",
    title: "דייסת סולת",
    author: "סבתא ברטה",
    tags: [
        "חלבי",
        "קינוחים"
    ],
    image: "https://static.wixstatic.com/media/55beb2_e5030096adc6442696c67239ad4832aa~mv2.jpg/v1/fill/w_2077,h_1558,al_c,q_90/55beb2_e5030096adc6442696c67239ad4832aa~mv2.webp",
    sourceUrl: "",
    ingredients: [
        {
            sectionName: "בסיס",
            items: [
                {
                    amount: 1,
                    unit: "כוסות",
                    item: "מים"
                },
                {
                    amount: 2,
                    unit: "כוסות",
                    item: "חלב"
                }
            ]
        },
        {
            sectionName: "סולת",
            items: [
                {
                    amount: 9,
                    unit: "כפיות מלאות",
                    item: "סולת"
                },
                {
                    amount: 0.5,
                    unit: "כוסות",
                    item: "חלב"
                }
            ]
        }
    ],
    instructions: "מביאים לרתיחה חלב עם מים (2/3 חלב 1/3 מים).\n\nבחצי כוס חלב ממיסים ומערבבים סולת (על כל כוס נוזלים 3 כפיות מלאות סולת). מערבבים היטב עד קבלת תערובת הומוגנית ללא גושים.\n\nעם רתיחת החלב מוסיפים את הסולת ומערבבים היטב למניעת גושים. מביאים לרתיחה ומנמיכים לאש קטנה עד להסמכת הדיסה\n\nאפשר להוסיף טעמים: אבקת שוקו, קינמון, וניל וכו'.\n"
},
{
    id: "tiramisu",
    title: "טירמיסו",
    author: "אופק",
    tags: [
        "חלבי",
        "עוגות"
    ],
    image: "https://www.cookingclassy.com/wp-content/uploads/2022/08/tiramisu-17.jpg",
    sourceUrl: "",
    ingredients: [
        {
            sectionName: "קרם",
            items: [
                {
                    amount: 500,
                    unit: "גרם",
                    item: "מסקרפונה (עדיף 40%+ שומן)"
                },
                {
                    amount: 150,
                    unit: "גרם",
                    item: "אבקת סוכר"
                },
                {
                    amount: 5,
                    unit: "כפות",
                    item: "ברנדי\\מרסלה\\רום\\ויסקי"
                },
                {
                    amount: 1,
                    unit: "מיכל",
                    item: "שמנת מתוקה"
                },
                {
                    amount: 5,
                    unit: "יח'",
                    item: "חלמונים"
                }
            ]
        },
        {
            sectionName: "ספוג",
            items: [
                {
                    amount: 400,
                    unit: "גרם",
                    item: "בישקוטים (עדיף איטלקטי)"
                },
                {
                    amount: 90,
                    unit: "מ\"ל",
                    item: "קפה חזק (3 מנות\\קפסולות)"
                },
                {
                    amount: 7,
                    unit: "כפות",
                    item: "ברנדי (או פחות, לפי הטעם)"
                },
                {
                    amount: 7,
                    unit: "כפות",
                    item: "קלואה (או פחות, לפי הטעם)"
                }
            ]
        },
        {
            sectionName: "למי שרוצה להכין בישקוטי - מומלץ, אבל לא חובה",
            items: [
                {
                    amount: 3,
                    unit: "יח'",
                    item: "ביצה (טמפ' החדר)"
                },
                {
                    amount: 75,
                    unit: "גרם",
                    item: "סוכר"
                },
                {
                    amount: 95,
                    unit: "גרם",
                    item: "קמח (מנופה)"
                },
                {
                    amount: 2,
                    unit: "כפיות",
                    item: "קורנפלור"
                },
                {
                    amount: 50,
                    unit: "גרם",
                    item: "אבקת סוכר"
                }
            ]
        }
    ],
    instructions: "המתכון לפי תבנית סטנדרטית של 35X23\n\n<u>קרם:\n</u>\n1. שמים את החלמונים, הסוכר והליקר על בן מארי וטורפים ללא הפסקה, עד שהנוזל מסמיך ומקבל מרקם דומה לפודינג. זה לוקח כ 5-10 דקות.\n2. מקציפים את השמנת לקצפת קלה ןכמעט יציבה (אם מוציאים כף נשארת גבעה עם שפיץ).\n3. מוסיפים את המסקרפונה לקצפת ומקציפים עוד קצת עד שמתקבלת קצפת אחידה ויציבה. להיזהר לא להקציף יותר מדי, אנחנו לא רוצים להגיע למרקם של פבלובה.\n4. מקפלים את תערובת החלמונים לקרם. הוא יראה מעט זהוב ונוזלי, אבל מאוחר יותר הוא משנה את צבעו ללבן ומתייצב בקירור.\n\n<u>הרכבה:</u>\n- מערבבים את תערובת הקפה בקערה רחבה, טובלים כל עוגיה קלות בנוזל ושמים בתבנית עד שכל התחתית מכוסה. יש להיזהר לא לטבול יותר מדי. העוגיה לא צריכה להיות ספוגה לגמרי, אחרת תתפרק וישארו משקעי נוזל בתחתית התבנית.\n- מורחים שכבת קרם אחידה מעל העוגיות.\n- שכבת עוגיות נוספת.\n- שכבת קרם נוספת.\n- להשאיר לילה במקרר להתייצבות.\n- לפני ההגשה, מפזרים מעל אבקת קקאו באמצעות מסננת.\n\n<u>מתכון לבישקוטי:</u>\nהחומרים ל-24 בישקוטי גדולים או 45 קטנים (6-7.5 ס\"מ):\n\n<u>כלים:\n</u>\n2 תבניות אפייה, מרופדות בנייר אפייה משומן\n\nלינק: https://www.cookie-fairy.com/2011/11/daring-bakers_1012/\n\n<u>אופן ההכנה:\n</u>\nלחמם תנור לחום בינוני 180 מעלות. להפריד את הביצים, ולהקציף את החלבונים בקערת מערבל חשמלי לקצף יציב. להוסיף פנימה בהדרגה את הסוכר ולהמשיך להקציף עד לקבלת קצף מבריק וחלק. בקערה קטנה לטרוף חלמונים במזלג ולקפל אותם בעדינות אל המרנג בעזרת כף עץ. לנפות את הקמח והקורנפלור מעל התערובת, ולקפל אותם פנימה בעדינות רק עד לקבלת תערובת חלקה, יש לקפל את התערובת כמה שפחות, ממש רק עד שמתאחדת, כדי לשמור על האווריריות הגדולה של הבלילה."
},
{
    id: "pastel",
    title: "פשטל דה נאטה",
    author: "אופק",
    tags: [
        "חלבי",
        "קינוחים"
    ],
    image: "images/pastel.jpg",
    sourceUrl: "",
    ingredients: [
        {
			sectionName: "לתחתית",
			items: [
				{
					amount: 300,
        unit: "גרם",
        item: "בצק עלים מופשר, עדיף על בסיס חמאה"
				}
			]
        },
        {
            sectionName: "לסירופ",
            items: [
                {
                    amount: 0.3333333333333333,
                    unit: "כוס",
                    item: "מים"
                },
                {
                    amount: 1,
                    unit: "כוס",
                    item: "סוכר"
                },
                {
                    amount: 2,
                    unit: "יח'",
                    item: "מקל קינמון"
                },
                {
                    amount: 2,
                    unit: "יח'",
                    item: "קליפת לימון מקולפת (לא מגוררת)"
                }
            ]
        },
        {
            sectionName: "למלית",
            items: [
                {
                    amount: 1,
                    unit: "כוס",
                    item: "חלב"
                },
                {
                    amount: 3,
                    unit: "כפות",
                    item: "קמח"
                },
                {
                    amount: 6,
                    unit: "יח'",
                    item: "חלמונים (L)"
                },
                {
                    amount: 1,
                    unit: "כפית",
                    item: "תמצית וניל"
                },
                {
                    amount: 0.25,
                    unit: "כוס",
                    item: "שמנת מתוקה"
                }
            ]
        },
        {
            sectionName: "ניתן להוסיף גם:",
            items: [
                {
                    amount: 1,
                    unit: "כף",
                    item: "ברנדי"
                },
                {
                    amount: 0.5,
                    unit: "כפית",
                    item: "קינמון טחון (צריך מסוג סיילון, אחרת גרוס גס מדי)"
                }
            ]
        }
    ],
    instructions: "המתכון לפי תבנית סטנדרטית של 35X23\n\nקרם:\n1. שמים את החלמונים, הסוכר והליקר על בן מארי וטורפים ללא הפסקה, עד שהנוזל מסמיך ומקבל מרקם דומה לפודינג. זה לוקח כ 5-10 דקות.\n2. מקציפים את השמנת לקצפת קלה ןכמעט יציבה (אם מוציאים כף נשארת גבעה עם שפיץ). \n3. מוסיפים את המסקרפונה לקצפת ומקציפים עוד קצת עד שמתקבלת קצפת אחידה ויציבה. להיזהר לא להקציף יותר מדי, אנחנו לא רוצים להגיע למרקם של פבלובה.\n4. מקפלים את תערובת החלמונים לקרם. הוא יראה מעט זהוב ונוזלי, אבל מאוחר יותר הוא משנה את צבעו ללבן ומתייצב בקירור. \n\nהרכבה:\n- מערבבים את תערובת הקפה בקערה רחבה, טובלים כל עוגיה קלות בנוזל ושמים בתבנית עד שכל התחתית מכוסה. יש להיזהר לא לטבול יותר מדי, העוגיה לא צריכה להיות נוזלית, אחרת תתפרק וישארו משקעי נוזל בתחתית התבנית.\n- מורחים שכבת קרם אחידה מעל העוגיות\n- שכבת עוגיות נוספת\n- שכבת קרם נוספת\n- להשאיר לילה במקרר להתייצבות. \n- לפני ההגשה, מפזרים מעל אבקת קקאו באמצעות מסננת.\n\nמתכון לבישקוטי: \nהחומרים ל-24 בישקוטי גדולים או 45 קטנים (6-7.5 ס\"מ):\n\nכלים:\n2 תבניות אפייה, מרופדות בנייר אפייה משומן\n\nלינק: https://www.cookie-fairy.com/2011/11/daring-bakers_1012/\n\nאופן ההכנה:\nלחמם תנור לחום בינוני 180 מעלות. להפריד את הביצים, ולהקציף את החלבונים בקערת מערבל חשמלי לקצף יציב. להוסיף פנימה בהדרגה את הסוכר ולהמשיך להקציף עד לקבלת קצף מבריק וחלק. בקערה קטנה לטרוף חלמונים במזלג ולקפל אותם בעדינות אל המרנג בעזרת כף עץ. לנפות את הקמח והקורנפלור מעל התערובת, ולקפל אותם פנימה בעדינות רק עד לקבלת תערובת חלקה, יש לקפל את התערובת כמה שפחות, ממש רק עד שמתאחדת, כדי לשמור על האווריריות הגדולה של הבלילה."
},
{
    id: "potato_salad",
    title: "סלט תפוחי אדמה בתנור",
    author: "אלי",
    tags: [
        "חלבי",
        "צמחוני"
    ],
    image: "",
    sourceUrl: "",
    ingredients: [
        {
            amount: 10,
            unit: "יח'",
            item: "תפוחי אדמה (עדיף אדומים לטיגון)"
        },
        {
            amount: 5,
            unit: "כפות גדושות",
            item: "מיונז הלמנס"
        },
        {
            amount: 1,
            unit: "כפית גדושה",
            item: "חרדל דיז'ון"
        },
        {
            amount: 5,
            unit: "יח'",
            item: "ביצים קשות"
        },
        {
            amount: 0.75,
            unit: "קופסא",
            item: "שימורי מלפפון חמוץ (קופסא בינונית)"
        },
        {
            amount: null,
            unit: "",
            item: "פלפל שחור"
        },
        {
            amount: null,
            unit: "",
            item: "שמן זית"
        },
        {
            amount: null,
            unit: "",
            item: "מלח גס"
        }
    ],
    instructions: "חותכים את תפוחי האדמה לחצי, ומסדרים בתבנית על נייר אפייה כאשר תפוחי האדמה שוכבים על החלק החתוך.\nמזלפים בנדיבות שמן זית ומוסיפים מלח גס.\nמכניסים לתנור בחום של 220 מעלות, עד שתפוחי האדמה מזהיבים (סמי חרוכים מלמטה).\nנותנים להם להתקרר מעט וחותכים חיתוך גס לקוביות.\nמוספים את הביצים הקשות (גם בחיתוך גס).\nמוסיפים את המלפפון החמוץ חתוך לפרוסות.\nמוסיפים את המיונז והחרדל ומעט פלפל שחור.\nמכניסים למקרר להצטננות קלה, \nובתיאבון"
},
{
    id: "coffee_tort",
    title: "טורט אגוזים וקפוצ'ינו",
    author: "מיקי שמו",
    tags: [
        "חלבי",
        "עוגות"
    ],
    image: "images/coffee_tort.jpg",
    sourceUrl: "https://www.mako.co.il/food-recipes/recipes_column-hospitality/Recipe-c819d7f427a6331006.htm",
    ingredients: [
        {
            sectionName: "לטורט",
            items: [
                {
                    amount: 6,
                    unit: "יח'",
                    item: "חלמונים (L)"
                },
                {
                    amount: 250,
                    unit: "גרם",
                    item: "סוכר"
                },
                {
                    amount: 2,
                    unit: "כוסות",
                    item: "אגוזי מלך קצוצים דק"
                },
                {
                    amount: 0.5,
                    unit: "כוס",
                    item: "קמח לבן"
                }
            ]
        },
        {
            sectionName: "לקצפת קפה",
            items: [
                {
                    amount: 2,
                    unit: "מיכלים",
                    item: "שמנת מתוקה"
                },
                {
                    amount: 0.5,
                    unit: "כוס",
                    item: "סוכר"
                },
                {
                    amount: 2,
                    unit: "כפיות",
                    item: "אבקת קפה נמס"
                }
            ]
        },
        {
            sectionName: "לציפוי",
            items: [
                {
                    amount: 1,
                    unit: "כוס",
                    item: "אגוזי לוז גרוסים גס וקלויים קלות"
                }
            ]
        }
    ],
    instructions: "כמות לתבנית עגולה 24\n\n1. מחממים תנור ל-160 מעלות.\n\n2. מכינים את הטורט: מקציפים חלבונים עם סוכר בקערת מיקסר כ-5 דקות במהירות בינונית לקצף יציב. מקפלים אגוזים וקמח בעזרת מרית לתערובת אחידה.\n\n3. מסמנים בעזרת עט או עיפרון 4 עיגולים בקוטר 22 ס”מ על 2 ניירות אפייה. הופכים את הניירות לצידם השני (כדי שהבצק לא יבוא במגע עם הסימון) ומניחים ב-2 תבניות תנור. מורחים בעזרת מרית 4 עיגולי בצק בקוטר הסימון ועובי כ-1/2 ס”מ.\n\n4. אופים כ-20 דקות עד הזהבה ומצננים היטב.\n\n5. מכינים את הקצפת: מקציפים שמנת מתוקה עם סוכר וקפה נמס לקצפת יציבה בגוון מוקה אחיד.\n\n6. מרכיבים את העוגה: מניחים שכבת טורט בתחתית תבנית קפיצית בקוטר 24 ס”מ ומורחים 1/4 מן המלית. מניחים שכבת טורט שנייה, דוחסים מעט ומורחים עוד 1/4 מן הקצפת. חוזרים על הפעולה עוד פעמיים. מפזרים אגוזי לוז, מכסים בניילון נצמד ומעבירים למקרר לשעתיים להתייצבות.\n\n7. מאחסנים מכוסה במקרר עד 3 ימים.\n\n<u>גיוונים</u>:\n\n• במקום אגוזי לוז משתמשים בבוטנים או בקוקוס טחון לציפוי העוגה.\n\n• מכינים רק 3 שכבות של בצק אגוזים מאותה כמות חומרים (הבצק יוצא יותר עבה) ומורחים ב-3 שכבות קצפת קפה עבות ומודגשות יותר."
},
{
    id: "earl_grey_cake",
    title: "עוגת ארל גריי",
    author: "אופק",
    tags: [
        "חלבי",
        "עוגות"
    ],
    image: "images/earl_grey_cake.jpg",
    sourceUrl: "https://www.haaretz.co.il/food/sweets/2020-08-14/ty-article-magazine/0000017f-f113-d8a1-a5ff-f19b62690000?utm_source=App_Share&utm_medium=Android_Native&utm_campaign=Share",
    ingredients: [
        {
            amount: 2,
            unit: "כוסות",
            item: "קמח לבן"
        },
        {
            amount: 1,
            unit: "כפית",
            item: "מלח"
        },
        {
            amount: 0.5,
            unit: "כפית",
            item: "אבקת אפיה"
        },
        {
            amount: 1,
            unit: "כפית",
            item: "סודה לשתייה"
        },
        {
            amount: 2,
            unit: "יח'",
            item: "ביצים (L)"
        },
        {
            amount: 0.5,
            unit: "יח'",
            item: "גרידה מלימון\\תפוז"
        },
        {
            amount: 200,
            unit: "גרם",
            item: "סוכר לבן"
        },
        {
            amount: 1,
            unit: "גביע",
            item: "יוגורט לא ממותק"
        },
        {
            amount: 0.25,
            unit: "כוס",
            item: "תה ארל גריי חזק בטמפ' החדר"
        },
        {
            amount: 26,
            unit: "גרם",
            item: "תה ארל גריי Twinings (או 13 תיונים מפורקים)"
        },
        {
            amount: 2,
            unit: "כפיות",
            item: "תמצית וניל"
        },
        {
            amount: 0.75,
            unit: "כוס",
            item: "שמן קנולה"
        },
        {
            sectionName: "לשכבת ביניים (לא חובה)",
            items: [
                {
                    amount: 2,
                    unit: "כפות",
                    item: "מייפל"
                }
            ]
        },
        {
            sectionName: "לפיזור מעל העוגה",
            items: [
                {
                    amount: 1,
                    unit: "כף",
                    item: "סוכר דמררה"
                }
            ]
        }
    ],
    instructions: "במקור זו עוגה של מיכל שמיר, שאחרי הרבה הכנות עשינו בה כמה שינויים.\n\nתבנית אינגליש קייק גדולה\n\n1. מחממים תנור ל-165 מעלות, ומשמנים את התבנית בשמן\\חמאה.\n2. מכינים 1/4 כוס תה ארל גריי, ונותנים לו לנוח עד שהוא מצטנן מעט (עם התיון בכוס), על מנת לקבל תה חזק מאוד.\n3. טורפים ביצים עם סוכר בקערה גדולה. טורפים את הביצים לפחות דקה, עד שהתערובת אוורירית ובצבע צהבהב בהיר.\n4. מערבבים את היבשים בקערה: קמח, מלח, אבקת אפייה ואבקת סודה לשתייה.\n5. מוסיפים לתערובת הביצים יוגורט, תה גרוס, התה שהכנו מראש, גרידת לימון\\תפוז ותמצית וניל. טורפים היטב עד שהכל מתאחד.\n6. מוסיפים שמן בהדרגה תוך כדי טריפה של התערובת.\n7. מוסיפים את תערובת החומרים היבשים ומערבבים עד לאיחודם בתערובת (לא יותר מדי).\n8. שופכים חצי מהבלילה לתבנית המשומנת.\n9. מפזרים מעל כמות נדיבה של מייפל.\n10. שופכים את שארית הבלילה, ומפזרים מעל סוכר דמררה.\n11. מכניסים לתנור החם לאפייה של כשעה, עד שקיסם הננעץ בעוגה יוצא נקי לגמרי.\n12. מניחים לעוגה להצטנן לחלוטין לפני שחותכים ממנה."
},{
    id: "sapir_cake",
    title: "העוגה של ספיר (עוגת שקדים שוודית)",
    author: "לייזה פאנלים",
    tags: [
        "חלבי",
        "עוגות"
    ],
    image: "images/sapir_cake.jpg",
    sourceUrl: "https://lizapanelim.com/%D7%A2%D7%95%D7%92%D7%AA-%D7%A9%D7%A7%D7%93%D7%99%D7%9D-%D7%A9%D7%95%D7%95%D7%93%D7%99%D7%AA/",
    ingredients: [
        {
            sectionName: "לבסיס",
            items: [
                {
                    amount: 1.5,
                    unit: "כוסות",
                    item: "קמח"
                },
                {
                    amount: 1,
                    unit: "כפית",
                    item: "אבקת אפייה"
                },
                {
                    amount: 3,
                    unit: "יח'",
                    item: "ביצים"
                },
                {
                    amount: 100,
                    unit: "גרם",
                    item: "אבקת סוכר"
                },
                {
                    amount: 1,
                    unit: "כף",
                    item: "גרידת תפוז"
                },
                {
                    amount: 100,
                    unit: "מ\"ל",
                    item: "מיץ תפוזים"
                },
                {
                    amount: 200,
                    unit: "מ\"ל",
                    item: "יוגורט"
                },
                {
                    amount: 100,
                    unit: "גרם",
                    item: "חמאה מומסת"
                }
            ]
        },
        {
            sectionName: "לטופינג",
            items: [
                {
                    amount: 150,
                    unit: "גרם",
                    item: "שקדים פרוסים"
                },
                {
                    amount: 0.6666666666666666,
                    unit: "כוס",
                    item: "סוכר חום"
                },
                {
                    amount: 100,
                    unit: "גרם",
                    item: "חמאה"
                },
                {
                    amount: 0.125,
                    unit: "כפית",
                    item: "מלח"
                },
                {
                    amount: 0.25,
                    unit: "כוס",
                    item: "שמנת מתוקה"
                }
            ]
        }
    ],
    instructions: "נחמם תנור ל-170 מעלות\n\n<u>בסיס:</u>\n1. מערבבים לקצף תפוח ביצים ואבקת סוכר\n2. בקערה נפרדת מערבבים חמאה מומסת עם יוגורט, גרידה ומיץ תפוזים. \n3. מאחדים תערובות, ומנפים פנימה קמח ואבקת אפייה עד איחוד.\n4. מכניסים לתנור: 170 מעלות כ-25 דקות עד הזהבה קלה.\n\n<u>טופינג:</u> \n1. בסיר קטן ממיסים חמאה, סוכר חום ומלח. כשנמס מוסיפים שמנת מתוקה ומערבבים. \n2. מוסיפים לסיר שקדים פרוסים ומערבבים עד איחוד.\n3. דוקרים בעוגה חורים קטנים עם מזלג.\n4. יוצקים את נוזל השקדים הסמיך והחם על העוגה.\n\nמורידים את חום התנור ל 160 מעלות ואופים את העוגה עוד 15 דקות. \nמצננים היטב לפני הגשה, ובתיאבון! (:"
},
];